[
    {
        "name": "M Q",
        "rating": "1",
        "date": "a year ago",
        "review_text": "there were a lot of positive reviews, so I am surprised by the soupy mess that is my dinner. I ordered triple delight and it is just swimming in sauce, the shrimp are TINY, the vegetables are overcooked, and it's full of cabbage. The egg …"
    },
    {
        "name": "Son'ja",
        "rating": "2",
        "date": "3 months ago",
        "review_text": "I ordered the general tso shrimp which was a disappointment. The flavor was nice but the shrimp were almost dime size and very thin.  They were coated with a very thick breading. You can’t even taste the shrimp. For $20! Definitely a waste. Shrimp should have been tossed back in the water."
    },
    {
        "name": "Mary Angelis",
        "rating": "4",
        "date": "6 months ago",
        "review_text": "The food was delicious.  The atmosphere was lively, but I’m not a fan of the decor.  Regardless, the food was amazing, and I’d eat here again if I ever come back to Atlanta."
    },
    {
        "name": "Gold's Bakery",
        "rating": "5",
        "date": "3 months ago",
        "review_text": "Sue became a great place to pick up your food to go. The staff is accommodating if you would like to sit, but for the most part, it is a takeout set up. The food never disappoints here. It is one of my go to places."
    },
    {
        "name": "Kevin Chao",
        "rating": "5",
        "date": "a year ago",
        "review_text": "This family owned Chinese restaurant sits comfortably between several bars and is a source of great food during the late night. …"
    },
    {
        "name": "Julie Dinh",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "If I could rate this less than a star I would. I’m so disappointed in this place. My first order through Uber eats was terrible and I really wanted to give this place another try so I ordered a couple different things off the menu. First …"
    },
    {
        "name": "Indie Renee",
        "rating": "1",
        "date": "2 months ago",
        "review_text": "The food was disgusting. We ordered sesame chicken with fried rice and it just did not taste good and the quality of the chicken was bad. Then we ordered the pad Thai and it was so salty all you tasted was fish sauce"
    },
    {
        "name": "Elizabeth Yi",
        "rating": "5",
        "date": "a year ago",
        "review_text": "came to Su’s with my boyfriend and oh my god it was so good. we got the salt and pepper shrimp and the house lo mein. totally satisfied our late night cravings and despite being 2:30am, the food was still amazing. 10/10 would recommend!"
    },
    {
        "name": "Katie Ryckeley",
        "rating": "5",
        "date": "2 months ago",
        "review_text": "Will definitely be coming back on a regular basis. Everything I ordered was amazing and the portion size was too good to be true."
    },
    {
        "name": "Tamiya Durham",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "Sesame chick was very hard and not very tasty. I wasn’t able to eat it all, because it was hard and honestly didn’t even taste like chicken. The fried rice was just bad. Poorly mixed and all, I could still see whole chunks of white rice. On …"
    },
    {
        "name": "Nick PP",
        "rating": "1",
        "date": "3 years ago",
        "review_text": "If I could give it zero stars I would. None of the food had any flavor. The chicken was over cooked and everything tasted terrible. Chicken and broccoli looked good but NO seasoning. Very disappointed."
    },
    {
        "name": "Jamell LovingChrist",
        "rating": "5",
        "date": "5 months ago",
        "review_text": "Su's excuse my French That food is the \"Shish.\" The best in TOWN! YES indeed. What I love is the fact we walk in we're greeted at the door and told to sit wherever we like which is sometimes barely a wait, or barely a spot to sit. The food …"
    },
    {
        "name": "Diana Mendez",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "What is this? I ordered a green curry and this is not green curry. It's super watery and flavorless. Paid $25 for it to get delivered to me along with a gingerale.  I'm eating little pieces of chicken just because I'm starving but otherwise …"
    },
    {
        "name": "Kai",
        "rating": "5",
        "date": "2 months ago",
        "review_text": "The food was delicious! Service was the best and everything came out in a timely manner! Perfect for late night eats when needed!"
    },
    {
        "name": "Elazar Wells",
        "rating": "5",
        "date": "6 months ago",
        "review_text": "During my visit to Su's, I was greeted by a welcoming ambiance and amiable staff. A staff member suggested the spicy beef bowl, a recommendation I found delightful. The establishment's exceptional customer service and cleanliness guarantee …"
    },
    {
        "name": "Ziraili -",
        "rating": "5",
        "date": "a year ago",
        "review_text": "The food was GREAT. Very filling and the customer service is wonderful. La comida es muy sabroso. I got black bean sauce with pork and I recommend!"
    },
    {
        "name": "Erica Davies",
        "rating": "3",
        "date": "8 months ago",
        "review_text": "For such high prices, the quantity of food is TOO small: $20 for 4 spare ribs is highway robbery. The chicken and broccoli was okay but way too saucy and not very flavorful, the egg drop soup tasted metallic and was watery. My order was …"
    },
    {
        "name": "Irielle Webber",
        "rating": "5",
        "date": "11 months ago",
        "review_text": "Food was good. I had the house fried rice. I asked for little spicy and it wa perfect. My friends were vegetarian and ordered those dishes and were very pleased. We came in about 130 am and food was ready in about 20 mins. It’s next to a bar so pretty convenient if partying and then hungry."
    },
    {
        "name": "Brookelynn",
        "rating": "5",
        "date": "a year ago",
        "review_text": "I have an ONION allergy..... an ONION ALLERGY.... THIS PLACE HAS KEPT ME ALIVE!!! for at least 2 years now and I get my fix of some of the best food I've had in a while 😫 I have never ordered in the restaurant... that's my next stop... but …"
    },
    {
        "name": "Amod Gehlot",
        "rating": "5",
        "date": "a year ago",
        "review_text": "I absolutely adore this place! It's the perfect spot to satisfy those late-night cravings after a night of clubbing or drinks. The food here is not only delicious but also packs a spicy punch. Yes, it's a bit greasy, but trust me, it's …"
    },
    {
        "name": "PSP Pearson",
        "rating": "5",
        "date": "a year ago",
        "review_text": "I want to add that we went again last Friday night & same rating!  I tried the Hunan “Beef” (vegan version & requested peanuts) and my husband got green curry w/ chicken.  Both dishes were savory and so satisfying.  We also tried the veggie …"
    },
    {
        "name": "Byron Barbre",
        "rating": "1",
        "date": "a year ago",
        "review_text": "Selected Delivery when ordering online. I was notified that delivery was not available after I paid for the order.  I drove over only to find the business is located in the armpit of hell. The owner gave inadequate answers to the issue with …"
    },
    {
        "name": "Victor Lawerence Alexander",
        "rating": "5",
        "date": "a year ago",
        "review_text": "I love this food! I don't leave midtown often with out it! Great kind staff! Thank you for loving and serving the community with kindness and great food! With out Sue's I would have never met Dave next door at Felix's!! Dave gave me my …"
    },
    {
        "name": "Mitch Leff",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "This was my go to choice for Chinese food. It has gone down hill. Egg rolls are half the size they used to be but cost the same. Dumplings we're soggy and gummy. The fried rice had no flavor and the quality of the meat was garbage, and the …"
    },
    {
        "name": "Ronan Pelot",
        "rating": "5",
        "date": "a year ago",
        "review_text": "I had the General Tso's chicken with beef fried rice, and it was absolutely amazing. The service was wonderful and the environment was so inviting and chill at the same time. I will definitely be coming back soon to try their other delicious foods."
    },
    {
        "name": "Jackie Chen",
        "rating": "5",
        "date": "a year ago",
        "review_text": "The food was really good and authentic, the service was phenomenal, and the location was really convenient for me. Will be going there again."
    },
    {
        "name": "Daniel Byrdsong",
        "rating": "2",
        "date": "a year ago",
        "review_text": "This evening Wednesday June 14, 2023 at 10 pm, the Chinese male staff was rude and very racist. Of all of the customers before and after me. This old Chinese male asked to see my receipt to verify my order yet he made it clear that he …"
    },
    {
        "name": "Kennedy Dumas",
        "rating": "1",
        "date": "a year ago",
        "review_text": "I’m telling you never ever ever eat here. I ordered white rice with sesame chicken and crab ragun.. The top layer of the rice was just like regular rice, no flavor but okay. As I kept eating the rice I noticed a very bad smell, the smell …"
    },
    {
        "name": "alexandra sparks",
        "rating": "2",
        "date": "3 years ago",
        "review_text": "I have been here twice in the past month. The first time I got sesame chicken and it was decent, so I am giving them 2 stars for that. It was like mall food court quality. Tonight I ordered sweet and sour chicken and coconut chicken soup. …"
    },
    {
        "name": "Chris",
        "rating": "5",
        "date": "11 months ago",
        "review_text": "Had some food there yesterday. Tried their shrimp fried rice with their general Tso’s chicken. Was really good! Thinking about getting it again today"
    },
    {
        "name": "Lorenzo Capasso",
        "rating": "1",
        "date": "8 months ago",
        "review_text": "The food is easily the worst Chinese food I have ever had. Can’t even make a good eggroll. Definitely regret going here…"
    },
    {
        "name": "Rebekah DuBenion",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "1 star is hardly deserved. The last two times I came here, I was utterly disappointed in the quality of the food. The Wonton soup was so bland I had to add a miso packet from my pantry to increase the flavor of the brown water broth and the …"
    },
    {
        "name": "Leonard Anderson",
        "rating": "3",
        "date": "2 years ago",
        "review_text": "I have been coming to this place for years for what use to be the best place to buy Shrimp Fried Rice. They have cut back on ingredients to making good SFR and cut the size by half and still charge went up too! Stop lying to the customer saying the size hasn't change. Nothing makes me more irritated with this place."
    },
    {
        "name": "Coco M",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "Like someone else said, if I could give this zero stars I would. This was the absolute most disgusting Chinese food I’ve ever had in my life. I didn’t even know it was possible to mess up fried rice the way they did. It has no taste, except …"
    },
    {
        "name": "Beauty Roses",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "I have ordered from this restaurant numerous times on Grubhub. Unlike other restaurants, this restaurant opts to deliver their own food. 100% of the time, the food has been fresh and flavorful. They have always gotten my order right, they …"
    },
    {
        "name": "rolan chowdhury",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "There food is garbage.  All of it is the cheapest ingredients & poorly made.  One of the items I got was thai fried rice.  Sometimes places that sell it don't have the sauce to make it and will let you know about it.  These folks used …"
    },
    {
        "name": "Conscious Products of Atlanta",
        "rating": "5",
        "date": "a month ago",
        "review_text": "Great 4am place everyday. Food perfect."
    },
    {
        "name": "Corey Davis",
        "rating": "1",
        "date": "3 years ago",
        "review_text": "This place just was bad. The rice seems to have been overcooked and then sat in water. The chicken wings, while the sauce was ok, were tiny. Not small, tiny. When I showed it to the manager or whoever, she said yes, they serve tiny wings. …"
    },
    {
        "name": "Amber Jade",
        "rating": "1",
        "date": "3 years ago",
        "review_text": "Food was horrible their eggrolls tasted Dowie. Their sesame chicken was not cooked all the way. I didn’t even want to try to lo mein noodles because it didn’t even look appealing at all. All of the food was so nasty my friend ask for a …"
    },
    {
        "name": "Aidan Tremper",
        "rating": "5",
        "date": "a year ago",
        "review_text": "Food was bussin fr fr no cap on god. Owner offered to let me borrow his car to go to my job interview. Guy that took our order was really friendly had good suggestions and I watched him stop a speeding bullet train on my way out"
    },
    {
        "name": "uju",
        "rating": "1",
        "date": "3 years ago",
        "review_text": "Ordered shrimp w broccoli and house special FF. Simply put, It was overpriced and gross. I couldn't eat the food and I dont know what happened but the fried rice had a very dry texture that wasn't ingestible without a swig of water/drink. …"
    },
    {
        "name": "Richard “Richy” West",
        "rating": "4",
        "date": "2 years ago",
        "review_text": "What can I say about Su’s Chinese Cuisine? In the words said from a customer couple months ago. “You are doing the Lord’s work here! The Lord’s work!“\nWhen you need a quick bite to eat, but don’t want to leave the premises of …"
    },
    {
        "name": "Khayla Kay",
        "rating": "1",
        "date": "a year ago",
        "review_text": "Lo mein was mushy and the shrimp & broccoli was over cooked. My shrimp were like steak. When I asked to have my lo mein remade she told me it’s supposed to be mushy"
    },
    {
        "name": "Subhan Poudel",
        "rating": "3",
        "date": "a year ago",
        "review_text": "Good Chinese place that’s open late night.\n\nOrdered the dinner combo with general tso’s chicken + lo mein. I thought the lo …"
    },
    {
        "name": "Kimmi TGX",
        "rating": "5",
        "date": "a year ago",
        "review_text": "If I could rate this place higher I would!!! The service is just as great as the food! Both the quality and the flavor is something you can rarely find now a days. Definitely recommend this place. Especially Singapore Noodles!!!!"
    },
    {
        "name": "em weat",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "i don’t usually write reviews but I LOVE SU’S!! i’ve been ordering from them for over a year and a half, and they get my order right every time. don’t listen to other reviews; i don’t know why people are expecting top quality from an …"
    },
    {
        "name": "Jessica Chan",
        "rating": "5",
        "date": "a year ago",
        "review_text": "The food tasted great and I love that it’s open super late. Definitely recommend the Siam basil shrimp and mongolian beef! The service was nice and fast for how busy it was."
    },
    {
        "name": "R M",
        "rating": "3",
        "date": "a year ago",
        "review_text": "The wings are delicious, I usually order them plain. The Egg Foo Young is TERRIBLE! They put way too much bean sprout in the egg foo young  which results in a stringy mess, its off putting"
    },
    {
        "name": "Raven Frank (TheFranklyReview)",
        "rating": "1",
        "date": "2 years ago",
        "review_text": "I ordered the sweet and sour chicken and litterally got chicken with NO SAUCE! And it litterally is freaking DISGUSTING!!!!!!! It sooooooo nasty and burnt anddddd the freaking fortune cookie litterallly isn’t even cooked it litterally …"
    },
    {
        "name": "Junior C",
        "rating": "1",
        "date": "3 years ago",
        "review_text": "Type of food you eat when everyplace is closed, and no other options.   Tonight's experience  included taking my money and telling me to wait outside,  immediately after taking my money.   The reason explained  was because they thought I …"
    }
]