[
    {
        "name": "G F",
        "rating": "5",
        "date": "9 months ago",
        "review_text": "Luis and his crew were phenomenal!  From the estimate phase to the finish phase. Very fast and professional. Cleanup was very efficient. They did the roof in one day. They worked a long 12 hour day.  My roof is very steep with a lot of …"
    },
    {
        "name": "Deonte Watkins",
        "rating": "5",
        "date": "4 years ago",
        "review_text": "Very professional, very helpful, knowledgeable, and quick. In one day my roof was fixed and as you can see in the pictures they did an excellent job! Also, out of all of the bidders, Vaqueros roofing by far has the best pricing. Luis is the man!!! I highly recommend!!"
    },
    {
        "name": "Chae Downing",
        "rating": "5",
        "date": "a year ago",
        "review_text": "Luis and Cowboy Construction did a great job on my roof. I first used them in 2018 to replace my roof. Five years later, I called them because I had a rodent problem caused by access through the soffits. Although I hired a rodent removal …"
    },
    {
        "name": "Julian Spears",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "Luis was very courteous and prompt. He took photos of my shingle issue and explained the problem. Luis was ready and able to handle my repair on the spot. He completed the repair quickly. He told me what to watch for if other shingles …"
    },
    {
        "name": "Jasper Spruell",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "It's not too often you are pleasantly surprised by a company in today's environment, but The Cowboy Roofer is one of those types of organizations that will provide service and knowledge that surpassed my expectations. I called Luis 11:00 am …"
    },
    {
        "name": "Monti House",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "Looking for roof replacement, got multiple quotes way beyond our retiree budget. Found Luis at Cowboy Construction on Craigslist and gave him a call. He came out the same day and gave us his quote which was the first that was actually …"
    },
    {
        "name": "Mike Zotta",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "I called Luis last year after speaking with several of the large Corporate owned roofing companies. He came out promptly and we discussed what I needed. I knew right away we were going to go with his company but at the last minute I had to …"
    },
    {
        "name": "Martin King",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Luis and his crew were very professional and punctual. From the inspection to the completion of the project the process was made easy. I am very satisfied with the roof installation and would definitely recommend this business to anyone looking to have their roof repaired"
    },
    {
        "name": "Shirley Gordon",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "I first needed gutter cleaning service and repair work around a damaged attic vent. My wife started calling roofing contractors in the South Atlanta area and this is the only contractor who would even consider cleaning gutters. He responded …"
    },
    {
        "name": "Vincent Martin",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "Luis is a professional in every sense of the word.  He contacted me less than 2 hrs after I emailed him. 1 hour later he was at my place looking at the job, 2 hours after that he and his crew were working on my project.  They stayed at it, …"
    },
    {
        "name": "Carla Prophet",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "I called the Cowboy Roofer on Sunday evening and he responded back right away. He told me he would be be here Monday morning. He was here by 8:00 am. I had a roof leak. He told me he would be back in two hours. He and his workers came back repaired my roof in an accurately and timely manner.  He was very courteous! Thanks!!!!"
    },
    {
        "name": "Anita Tate",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "This is a company that reacts to the need of a homeowner. Luis is quick to respond to the call and need of a homeowner. He came at time of appointment, no pressure to sale the job. He let my wife and I call him back, to purchase the …"
    },
    {
        "name": "Nicole Skipper",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "Luis was awesome.  He helped my mother with her roof that needed repairs.  He was courteous, very professional, and reasonably priced.  I would recommend him to anyone."
    },
    {
        "name": "Shaquille durant",
        "rating": "5",
        "date": "4 years ago",
        "review_text": "I usually don’t leave reviews but I was truly impressed with Luis! He came to my home same day, evaluated my roof and gutters quickly with next day repairs! Thank you. I will continue to do business with this business!"
    },
    {
        "name": "Jeff",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "Had a roof leak near the chimney on an old country home in Barnesville. These guys came out, replaced rotted plywood, and redid the flashing around the chimney. They did an excellent job. This house was 3 stories high, with a steep roof, …"
    },
    {
        "name": "Leshell Lowery",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Honest, very professional  Luis came and knew exactly what needed to be done other contracted estimated wrong, employees also honest & professional and neat I advise anyone if u need any roofing repair this is the company to contact 10 stars instead of 5"
    },
    {
        "name": "Sharon Delgado",
        "rating": "5",
        "date": "4 years ago",
        "review_text": "I had contacted another company for the repair but they were too expensive so I contacted Luis at this company and fixed the leak and repaired the shingles. I would recommend this service to anyone who asks. Well done at an affordable cost."
    },
    {
        "name": "Dman Cruver",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "This company did a wonderful job on my mothers roof! The workers were very professional and did their job with good quality!! Will most definitely call them again if needed!"
    },
    {
        "name": "James Stewart",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "They did a great job I call him all the time I own several property’s and Luis is fair and great I highly recommend"
    },
    {
        "name": "Snow Bates",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "ABSOLUTELY AMAZING!!!! The level of professionalism and attention to detail was remarkable. Very HONEST and that’s so hard to find today. If you don’t use this company you are doing yourself as well as your home an injustice!!!!!"
    },
    {
        "name": "Martha Redmond",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Very pleased with the quality of work. We would definitely use him again and recommend him to friends and family!"
    },
    {
        "name": "Beverly Harrison",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Workers did a great job.  Have used this business for several years!  Always happy with results."
    },
    {
        "name": "Vladimir Nikitenko",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Asked for custom flashing and he was able to building exactly what I need. Will be reaching out for gutters in a few months."
    },
    {
        "name": "Eric Carston",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Did vinyl siding repair for me along with a roof inspection. And I must admit I was Amazed! Thank you."
    },
    {
        "name": "David Francis",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Great service\nTY for repairing my siding"
    },
    {
        "name": "Cliff Brown",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Great job and was very professional."
    },
    {
        "name": "Gwen Maddox",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "Excellent work and very professional!"
    },
    {
        "name": "Karina Romero",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Jennifer Newby",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Debra Cruvee",
        "rating": "5",
        "date": "2 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Erick López",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Antoinette Hale",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Retta Billups",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Leticia Mendoza",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Stephanie Cooper",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Yvonne Greenidge",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Artemus Hudson",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "sofia franquez",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Miguel Montero",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "C Freeman",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Roger Williams",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Urasula Thompson",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Michael Boscarello",
        "rating": "5",
        "date": "3 years ago",
        "review_text": "N/A"
    },
    {
        "name": "Marion Van",
        "rating": "5",
        "date": "4 years ago",
        "review_text": "N/A"
    }
]