{
  "heroText": "Experience the best in roofing services with our exceptional team and commitment to customer satisfaction.",
  "cards": [
    {
      "title": "Exceptional Service",
      "desc": "Our friendly and knowledgeable staff ensures a seamless experience from start to finish.",
      "icon": "Shield"
    },
    {
      "title": "Quality Craftsmanship",
      "desc": "We deliver top-notch roofing solutions using premium materials for long-lasting results.",
      "icon": "Award"
    },
    {
      "title": "Timely Delivery",
      "desc": "Count on us to complete your project efficiently without compromising on quality.",
      "icon": "Clock"
    },
    {
      "title": "Customer Satisfaction",
      "desc": "Our goal is to exceed your expectations and leave you fully satisfied with our work.",
      "icon": "Heart"
    }
  ],
  "summary": "ldjshflkj sadhkl jhfds alkjhdflk jhfdlkajs hdfklja hfdkljh kdjfshlk dfashlkdjf fdjkh fdlkja hfdlkjahfd lkjfd k dfkj hfdlkj fdjkh fdakjh dslkjah dsfjkhfdl jkhalmdbf kjfhdlkjadfh df fjdh fsdkaljh fdklhjafjkdl ", 
  "yearsOfExcellenceTitle": "Over a Decade of Roofing Excellence",
  "yearsOfExcellenceDesc": "With over 10 years of experience, we have established ourselves as a trusted name in the roofing industry.",
  "aboutCards": [
    {
      "title": "Expert Team",
      "desc": "Our team consists of skilled professionals dedicated to providing top-tier roofing solutions.",
      "icon": "Tool"
    },
    {
      "title": "Customer Focus",
      "desc": "We prioritize customer needs and ensure clear communication throughout the project.",
      "icon": "Smile"
    },
    {
      "title": "Reliable Solutions",
      "desc": "Trust us for reliable roofing services that enhance the durability and aesthetics of your property.",
      "icon": "CheckCircle"
    }
  ],
  "whyChooseFeatures": [
    {
      "title": "Premium Materials",
      "desc": "We use high-quality materials to ensure the longevity and performance of your roof.",
      "icon": "Layers"
    },
    {
      "title": "Expert Craftsmanship",
      "desc": "Our team of skilled roofers delivers precision and expertise in every project we undertake.",
      "icon": "Zap"
    },
    {
      "title": "Customer Satisfaction Guarantee",
      "desc": "We are committed to ensuring your satisfaction by delivering exceptional service and results.",
      "icon": "ThumbsUp"
    },
    {
      "title": "Transparent Pricing",
      "desc": "We provide transparent pricing and detailed quotes to give you peace of mind throughout the process.",
      "icon": "Tag"
    }
  ]
}